# Handling Date Time data

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with Dates

In [8]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

1. ***Extract Year***

In [10]:
date['year'] = date['date'].dt.year

In [11]:
date.head()

        date  product_id  city_id  orders  year
0 2019-12-10        5628       25       3  2019
1 2018-08-15        3646       14     157  2018
2 2018-10-23        1859       25       1  2018
3 2019-08-17        7292       25       1  2019
4 2019-01-06        4344       25       3  2019

2. ***Extract Month***

In [12]:
date['date_month_no'] = date['date'].dt.month

In [13]:
date.head()

        date  product_id  city_id  orders  year  date_month_no
0 2019-12-10        5628       25       3  2019             12
1 2018-08-15        3646       14     157  2018              8
2 2018-10-23        1859       25       1  2018             10
3 2019-08-17        7292       25       1  2019              8
4 2019-01-06        4344       25       3  2019              1

In [14]:
date['date_month_name'] = date['date'].dt.month_name()

In [15]:
date.sample()

,date,product_id,city_id,orders,year,date_month_no,date_month_name
297,2019-12-02,5653,17,4,2019,12,December

3. ***Extract Day***

In [16]:
date['day'] = date['date'].dt.day

In [17]:
date.head()

,date,product_id,city_id,orders,year,date_month_no,date_month_name,day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [18]:
# Day of week
date['dow'] = date['date'].dt.dayofweek

In [19]:
date.head()

,date,product_id,city_id,orders,year,date_month_no,date_month_name,day,dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [20]:
#Day of the week
date['date_dow_name'] = date['date'].dt.day_name()

In [21]:
date.head()

,date,product_id,city_id,orders,year,date_month_no,date_month_name,day,dow,date_dow_name
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [23]:
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday','Saturday']) , 1,0)

date.drop(columns = ['product_id','city_id','orders']).sample()

,date,year,date_month_no,date_month_name,day,dow,date_dow_name,date_is_weekend
547,2019-06-21,2019,6,June,21,4,Friday,0

In [27]:
date['date_week'] = date['date'].dt.isocalendar().week
date.drop(columns = ['product_id','city_id','orders']).head()

,date,year,date_month_no,date_month_name,day,dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

***Extract Quarter***

In [29]:
date['quarter'] = date['date'].dt.quarter
date.drop(columns = ['product_id','city_id','orders']).head()

,date,year,date_month_no,date_month_name,day,dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

***Extract Semester***

In [31]:
date['semester'] = np.where(date['quarter'].isin([1,2]) ,1,2)
date.drop(columns = ['product_id','city_id','orders']).head()

,date,year,date_month_no,date_month_name,day,dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

***Extract time elapsed between two dates***

In [32]:
import datetime
today = datetime.datetime.today()

today

datetime.datetime(2022, 6, 14, 17, 32, 39, 807961)

In [33]:
today - date['date']

0      917 days 17:32:39.807961
1     1399 days 17:32:39.807961
2     1330 days 17:32:39.807961
3     1032 days 17:32:39.807961
4     1255 days 17:32:39.807961
                 ...
995   1345 days 17:32:39.807961
996   1286 days 17:32:39.807961
997   1134 days 17:32:39.807961
998   1199 days 17:32:39.807961
999    973 days 17:32:39.807961
Name: date, Length: 1000, dtype: timedelta64[ns]

In [34]:
(today - date['date']).dt.days

0       917
1      1399
2      1330
3      1032
4      1255
       ...
995    1345
996    1286
997    1134
998    1199
999     973
Name: date, Length: 1000, dtype: int64

In [35]:
np.round((today - date['date']) / np.timedelta64(1,'M'),0)

0      30.0
1      46.0
2      44.0
3      34.0
4      41.0
       ...
995    44.0
996    42.0
997    37.0
998    39.0
999    32.0
Name: date, Length: 1000, dtype: float64

In [39]:
(today - date['date']).dt

In [40]:
time

                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [42]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [45]:
time['date'] = pd.to_datetime(time['date'])

In [46]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [49]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.sample(5)

,date,msg,hour,min,sec
686,2012-08-16 01:02:00,Девушки давайте знакомица перезваню 0673573019...,1,2,0
141,2016-11-05 22:54:00,м для м.095 767 56 87.ты за 30.,22,54,0
595,2012-05-14 01:40:00,ИЩУ ДЕВ НЕ ВЫШЕ160СМ ОТ18-23ОДИНОКУЮ ДЛЯ С/О С...,1,40,0
60,2014-10-20 00:40:00,Для милой и нежной девушки 26.,0,40,0
169,2014-05-19 23:07:00,Хтось проголосував ЗА кліп Лигалайз — Рожденны...,23,7,0

In [50]:
# Extracting time
time['time'] = time['date'].dt.time

In [51]:
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [53]:
# Time difference
today - time['date']

0     3103 days 16:42:39.807961
1     2967 days 17:52:39.807961
2     3453 days 17:11:39.807961
3     2755 days 17:01:39.807961
4     3152 days 18:21:39.807961
                 ...
995   3742 days 16:42:39.807961
996   3063 days 18:18:39.807961
997   3528 days 17:55:39.807961
998   3644 days 17:58:39.807961
999   2916 days 18:07:39.807961
Name: date, Length: 1000, dtype: timedelta64[ns]

In [56]:
# Time difference in seconds
(today - time['date']) / np.timedelta64(1,'s')

0      2.681594e+08
1      2.564132e+08
2      2.984011e+08
3      2.380933e+08
4      2.723989e+08
           ...
995    3.233690e+08
996    2.647091e+08
997    3.048837e+08
998    3.149063e+08
999    2.520077e+08
Name: date, Length: 1000, dtype: float64

In [57]:
# Time difference in minutes
(today - time['date']) / np.timedelta64(1,'m')

0      4.469323e+06
1      4.273553e+06
2      4.973352e+06
3      3.968222e+06
4      4.539982e+06
           ...
995    5.389483e+06
996    4.411819e+06
997    5.081396e+06
998    5.248439e+06
999    4.200128e+06
Name: date, Length: 1000, dtype: float64

In [59]:
# Time difference in hours
(today - time['date']) / np.timedelta64(1,'h')

0      74488.711058
1      71225.877724
2      82889.194391
3      66137.027724
4      75666.361058
           ...
995    89824.711058
996    73530.311058
997    84689.927724
998    87473.977724
999    70002.127724
Name: date, Length: 1000, dtype: float64